; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v1)
             (pred_9 ?v13 ?v2)
             (pred_10 ?v11 ?v2)
             (pred_12 ?v10 ?v11 )
	     (pred_1 ?v11)
             (pred_5 ?v9)
             (pred_3 ?v13)
             (pred_7 ?v2)
             (pred_2 ?v11)
             (pred_8 ?v13)
             (pred_4 ?v11)
             (pred_6 ))



(:action op_3
:parameters (?v3 ?v12 ?v4 ?v7)
:precondition (and (pred_5 ?v3) (pred_5 ?v12) (pred_3 ?v4) (pred_7 ?v7)
          (pred_11 ?v3 ?v12) (pred_9 ?v4 ?v7)
                   (pred_10 ?v12 ?v7) (pred_1 ?v3) 
                   (pred_2 ?v12) (pred_8 ?v4))
:effect (and  (pred_4 ?v12) (not (pred_2 ?v12))))


(:action op_2
:parameters (?v3 ?v5)
:precondition (and (pred_5 ?v3) (pred_5 ?v5)
               (pred_1 ?v3) (pred_11 ?v3 ?v5) (pred_4 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v3))))

(:action op_1
:parameters (?v3 ?v4)
:precondition (and (pred_5 ?v3) (pred_3 ?v4) 
                  (pred_1 ?v3) (pred_12 ?v4 ?v3) (pred_6 ))
:effect (and (pred_8 ?v4)
   (not (pred_12 ?v4 ?v3)) (not (pred_6 ))))


(:action op_5
:parameters (?v3 ?v8 ?v6)
:precondition (and (pred_5 ?v3) (pred_3 ?v8) (pred_3 ?v6)
                  (pred_1 ?v3) (pred_8 ?v6) (pred_12 ?v8 ?v3))
:effect (and (pred_8 ?v8) (pred_12 ?v6 ?v3)
        (not (pred_8 ?v6)) (not (pred_12 ?v8 ?v3))))

(:action op_4
:parameters (?v3 ?v4)
:precondition (and (pred_5 ?v3) (pred_3 ?v4) 
                  (pred_1 ?v3) (pred_8 ?v4))
:effect (and (pred_6 ) (pred_12 ?v4 ?v3) (not (pred_8 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_10 obj_30 obj_24 obj_16 obj_21 obj_11 obj_04 obj_12 obj_18 obj_22 obj_01 obj_19 obj_05 obj_28 obj_20 obj_27 obj_09 obj_13 obj_29 obj_02 obj_14 obj_17 obj_23 obj_15
    obj_25 obj_07
    obj_08 obj_26 obj_03
    )

    (:init
       (pred_6)

       (pred_5 obj_06)
       (pred_5 obj_10)
       (pred_5 obj_30)
       (pred_5 obj_24)
       (pred_5 obj_16)
       (pred_5 obj_21)
       (pred_5 obj_11)
       (pred_5 obj_04)
       (pred_5 obj_12)
       (pred_5 obj_18)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_19)
       (pred_5 obj_05)
       (pred_5 obj_28)
       (pred_5 obj_20)
       (pred_5 obj_27)
       (pred_5 obj_09)
       (pred_5 obj_13)
       (pred_5 obj_29)
       (pred_5 obj_02)
       (pred_5 obj_14)
       (pred_5 obj_17)
       (pred_5 obj_23)
       (pred_5 obj_15)
       (pred_7 obj_25)
       (pred_7 obj_07)
       (pred_3 obj_08)
       (pred_3 obj_26)
       (pred_3 obj_03)

       (pred_11 obj_06 obj_21)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_10 obj_11)
       (pred_11 obj_10 obj_30)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_30 obj_04)
       (pred_11 obj_30 obj_24)
       (pred_11 obj_30 obj_10)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_24 obj_16)
       (pred_11 obj_24 obj_30)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_24)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_21 obj_11)
       (pred_11 obj_21 obj_06)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_11 obj_10)
       (pred_11 obj_11 obj_21)
       (pred_11 obj_04 obj_19)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_30)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_12 obj_05)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_18 obj_28)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_01)
       (pred_11 obj_22 obj_21)
       (pred_11 obj_01 obj_27)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_22)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_04)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_05 obj_28)
       (pred_11 obj_05 obj_12)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_28 obj_29)
       (pred_11 obj_28 obj_18)
       (pred_11 obj_28 obj_05)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_27 obj_14)
       (pred_11 obj_27 obj_09)
       (pred_11 obj_27 obj_01)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_13)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_27)
       (pred_11 obj_13 obj_23)
       (pred_11 obj_13 obj_29)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_13 obj_09)
       (pred_11 obj_29 obj_15)
       (pred_11 obj_29 obj_28)
       (pred_11 obj_29 obj_13)
       (pred_11 obj_02 obj_14)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_14 obj_17)
       (pred_11 obj_14 obj_27)
       (pred_11 obj_14 obj_02)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_14)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_23 obj_13)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_15 obj_29)
       (pred_11 obj_15 obj_23)
       (pred_2 obj_28)
       (pred_2 obj_11)
       (pred_2 obj_05)
       (pred_10  obj_28 obj_25)
       (pred_10  obj_11 obj_07)
       (pred_10  obj_05 obj_25)
       (pred_4 obj_06)
       (pred_4 obj_10)
       (pred_4 obj_30)
       (pred_4 obj_24)
       (pred_4 obj_16)
       (pred_4 obj_21)
       (pred_4 obj_04)
       (pred_4 obj_12)
       (pred_4 obj_18)
       (pred_4 obj_22)
       (pred_4 obj_01)
       (pred_4 obj_19)
       (pred_4 obj_20)
       (pred_4 obj_27)
       (pred_4 obj_09)
       (pred_4 obj_13)
       (pred_4 obj_29)
       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_4 obj_17)
       (pred_4 obj_23)
       (pred_4 obj_15)

       (pred_9  obj_08 obj_25)
       (pred_9  obj_26 obj_07)
       (pred_9  obj_03 obj_07)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_26 obj_27)
       (pred_12 obj_03 obj_18)
       (pred_1 obj_20)
    )

    (:goal (and
       (pred_12 obj_03 obj_01)
    ))
(:constraints
  (always (not (pred_1 obj_19)))
)
)

; plan
1. (op_2 obj_20 obj_27)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_27)
   goals met: 0 of 1
2. (op_1 obj_27 obj_26)
   deleted: (pred_12 obj_26 obj_27) (pred_6)
   added: (pred_8 obj_26)
   goals met: 0 of 1
3. (op_2 obj_27 obj_01)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_01)
   goals met: 0 of 1
4. (op_3 obj_01 obj_11 obj_26 obj_07)
   deleted: (pred_2 obj_11)
   added: (pred_4 obj_11)
   goals met: 0 of 1
5. (op_4 obj_01 obj_26)
   deleted: (pred_8 obj_26)
   added: (pred_6) (pred_12 obj_26 obj_01)
   goals met: 0 of 1
6. (op_2 obj_01 obj_11)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_11)
   goals met: 0 of 1
7. (op_2 obj_11 obj_04)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_04)
   goals met: 0 of 1
8. (op_2 obj_04 obj_12)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_12)
   goals met: 0 of 1
9. (op_2 obj_12 obj_18)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_18)
   goals met: 0 of 1
10. (op_1 obj_18 obj_03)
   deleted: (pred_12 obj_03 obj_18) (pred_6)
   added: (pred_8 obj_03)
   goals met: 0 of 1
11. (op_2 obj_18 obj_12)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_12)
   goals met: 0 of 1
12. (op_2 obj_12 obj_04)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_04)
   goals met: 0 of 1
13. (op_2 obj_04 obj_11)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_11)
   goals met: 0 of 1
14. (op_2 obj_11 obj_01)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_01)
   goals met: 0 of 1
15. (op_5 obj_01 obj_08 obj_03)
   deleted: (pred_8 obj_03) (pred_12 obj_08 obj_01)
   added: (pred_8 obj_08) (pred_12 obj_03 obj_01)
   goals met: 1 of 1
